export const phrases = {
  welcome: 'Привет, я помогу тебе не забывать фрразы на иностранном языке',
  enter_add: 'Для того чтобы добавить фразы тебе нжуно написать их в формате <eng_ph> => <rus_ph>, а каждая новая фраза с новойс строки',
  finish_advice: '/n /n Для выхода нажми /finish',
  add_phrases_length_error: 'Очень длинные фразы, давай попробуем короче',
  add_phrases_error: 'Некорректные фраыз, давай попробуем еще раз',
  add_phrases_success: 'Фразы успешно добавлены',
  enter_repeater: 'Привет, давай, повторим фразы. Я буду выдавать случайные фразы, а ты будешь пытаться их перевести. А потом нажми кнопку далее. И я выдам тебе следующую фразу. Нажми начаать, чтобы начать',
  enter_repeater_error: 'Не удалось загрузить список фраз, возможно он пуст?',
  leave_scene: 'Пока',
  repeater_finish_repeat: 'Начать заново или повторить ошибочные?',
  repeater_have_no_wrong_answeres: 'Ты нигде не ошибся, поэтому выходим',
  repeater_again: 'Начинаем с начала',
  repeater_continue: 'Продолжаем'
}
